Repository: TypeWhisper/typewhisper-mac
Catalog: TypeWhisperPluginSDK/Plugins/MetaPlugin/Localizable.xcstrings
Source language: en
Languages: de, ja, zh_hans

source: API Key
de: API-Schlüssel
ja: APIキー
zh_hans: API 密钥

source: Connected
de: Verbunden
ja: 接続済み
zh_hans: 已连接

source: Connection Failed
de: Verbindung fehlgeschlagen
ja: 接続に失敗しました
zh_hans: 连接失败

source: Contributor models may use prompts and completions to train future Meta models.
de: Contributor-Modelle dürfen Prompts und Antworten zum Training zukünftiger Meta-Modelle verwenden.
ja: Contributorモデルでは、将来のMetaモデルの学習にプロンプトと応答が使用される場合があります。
zh_hans: Contributor 模型可能会使用提示词和生成内容来训练未来的 Meta 模型。

source: Models are loaded dynamically from Meta and cached for offline settings access.
de: Modelle werden dynamisch von Meta geladen und für den Offline-Zugriff in den Einstellungen zwischengespeichert.
ja: モデルはMetaから動的に取得され、オフライン設定用にキャッシュされます。
zh_hans: 模型从 Meta 动态加载，并会缓存，以便离线访问设置。

source: Prompt Model
de: Prompt-Modell
ja: プロンプトモデル
zh_hans: 提示词模型

source: Remove
de: Entfernen
ja: 削除
zh_hans: 移除

source: Realtime transcription streams 16 kHz PCM over Meta's WebSocket API. Speaker diarization applies to both realtime and uploaded audio.
de: Die Echtzeittranskription streamt 16-kHz-PCM über Metas WebSocket-API. Die Sprechererkennung gilt sowohl für Echtzeit- als auch für hochgeladene Audiodateien.
ja: リアルタイム文字起こしはMetaのWebSocket APIを通じて16 kHz PCMをストリーミングします。話者分離はリアルタイム音声とアップロード音声の両方に適用されます。
zh_hans: 实时转录通过 Meta 的 WebSocket API 流式传输 16 kHz PCM 音频。说话人分离同时适用于实时音频和上传的音频。

source: Save and Refresh Models
de: Speichern und Modelle laden
ja: 保存してモデルを更新
zh_hans: 保存并刷新模型

source: The API key is stored securely in the macOS Keychain.
de: Der API-Schlüssel wird sicher im macOS-Schlüsselbund gespeichert.
ja: APIキーはmacOSキーチェーンに安全に保存されます。
zh_hans: API 密钥安全存储在 macOS 钥匙串中。

source: Speaker diarization
de: Sprechererkennung
ja: 話者分離
zh_hans: 说话人分离

source: Transcription Model
de: Transkriptionsmodell
ja: 文字起こしモデル
zh_hans: 转录模型
